# SetClassBeginningMarker

## Description
Sets all properties for the named class' beginning marker. Return TRUE if operation was successful.

```pascal
FUNCTION SetClassBeginningMarker(
				name           : STRING;
				style          : LONGINT;
				angle          : INTEGER;
				size           : REAL;
				width          : REAL;
				thicknessBasis : INTEGER;
				thickness      : REAL) : BOOLEAN;
```

```python

def vs.SetClassBeginningMarker(name, style, angle, size, width, thicknessBasis, thickness):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Name of the class |
|style|LONGINT|The marker style (see comments for details)|
|angle|INTEGER|The marker angle in degrees (0 to 90)|
|size|REAL|The marker size in pages inches|
|width|REAL|The marker width in page inches|
|thicknessBasis|INTEGER|The marker thickness basis. ( see comments for details)|
|thickness|REAL|The marker thickness|

## Examples
```pascal
PROCEDURE Example;

VAR

	ok : BOOLEAN;

BEGIN

	ok := SetClassBeginningMarker('None', 1280, 45, 0.25, 0.25, 0, 2);

END;

RUN(Example);

```

## See Also
VS Functions:
SetClassEndMarker

## Version
Availability: from VectorWorks 2008
## Category
* Classes